// 230828_string
//
// Кодировки
//
// ASCII - американский стандартный код (7бит)
//
// UNICODE - не кодировка, это таблица символов (11 114 112 позиций, разбиты на 17 блоков, 65000 в каждом блоке)
// 0 блок - основной и содержит символы всех современных алфавитов
// остальные заполнены буквами вымерших языков, различными символами (карточные масти, стрелочки, эмодзи)
// 
// UTF: UTF8, UTF16, UTF32
// 
// первые 127 символов UTF8  занимают 1 байт и совпадают с символами ASCII, поэтому не требуют конвертации
// символы больше 128 занимают от 2 до 6 байт
//




#include <iostream>

int main()
{
}

